// *++
//
// Copyright (c) 2004 - 2007, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution.  The full text of the license may be found at        
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   Strings.vfr
// 
// Abstract:
// 
//   String definitions for BdsPlatform formset.
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_INTERNAL_EFI_SHELL         #language eng  "[Internal EFI Shell]"
                                       #language fra  "[la Coquille interne de EFI]"
#string STR_LEGACY_BOOT_A              #language eng  "[Internal Legacy Boot A:]"
                                       #language fra  "[Le Legs interne Charge A:]"
#string STR_PROCESSED_ALL_BOOT_OPTIONS #language eng  "[ProcessedAllBootOptions(): Load shell from the FV]"
                                       #language fra  "[ProcessedAllBootOptions() : la coquille de Chargement du FV]"
#string STR_BOOT_FAILED                #language eng  "Boot Failed. "
                                       #language fra  "la Botte A. "
#string STR_BOOT_SUCCEEDED             #language eng  "Boot Succeeded - "
                                       #language fra  "Charge Réussi - "
#string STR_DEFAULT_TIMEOUT_BANNER     #language eng  "Default boot selection will be booted in "
                                       #language fra  "la sélection de botte de Défaut sera dans "
#string STR_SECONDS                    #language eng  " seconds"
                                       #language fra  " les secondes"
#string STR_EXIT_DATA                  #language eng  "ExitData: "
                                       #language fra  "ExitData: "
#string STR_LOADING                    #language eng  "Loading: "
                                       #language fra  "Chargement: "
#string STR_ENTER_NORMAL_BOOT          #language eng  "Entering Normal Boot Process..."
                                       #language fra  "l'Entrer le Procédé de Botte Normal..."
#string STR_PERFORM_MEM_TEST           #language eng  "Perform memory test (ESC to skip)"
                                       #language fra  "Exécute l'examen de mémoire (ESC pour sauter)"
#string STR_MEMORY_TEST_PERCENT        #language eng  "% of the system memory tested OK"
                                       #language fra  "% de la mémoire de système essayée D'ACCORD"
#string STR_ESC_TO_SKIP_MEM_TEST       #language eng  "Press ESC key to skip memory test"
                                       #language fra  "Appuie sur ESC sauter examen de mémoire"
#string STR_MEM_TEST_COMPLETED         #language eng  " bytes of system memory tested OK"
                                       #language fra  "octets dela mémoire de système essayée D'ACCORD"
#string STR_NO_EXT_MEM_FOUND           #language eng  "Memory resource updated!"
                                       #language fra  "la mémoire Non étendue trouvée!"
#string STR_SYSTEM_MEM_ERROR           #language eng  "System encounters memory errors"
                                       #language fra  "le Système rencontre les erreurs de mémoire"
#string STR_START_BOOT_OPTION          #language eng  "Start boot option"
                                       #language fra  "l'option de botte de Début"

